#SQL + PYTHON

![keepcoding](https://media.giphy.com/media/26vACLXgansDXwHzzI/giphy.gif)

##SQL Alchemy
SQLAlchemy is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL.

It provides a full suite of well known enterprise-level persistence patterns, designed for efficient and high-performing database access, adapted into a simple and Pythonic domain language.

### Install needed?

In [ ]:
#!pip install sqlalchemy
#!pip install pymysql

In [1]:
import pandas as pd
import sqlalchemy as alch

To work with SQLAlchemy first we need to create an engine. The engine is the entering point to the database, it is what allowes SQALchemy to communicate with the data.
More info: 
- https://docs.sqlalchemy.org/en/14/

###Connection
Let's introduce the password

In [2]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password: 路路路路路路路路

Set the database, and create the connection calling the variable engine.

In [8]:
dbName = "bank"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [9]:
# check engine connection
engine

Engine(mysql+pymysql://root:***@localhost/bank)

### ACTIVITY 1: Queries

#### 1. Save the table loan as a dataset

In [10]:
loan_df = pd.read_sql_query(
"""
SELECT * FROM loan;
""", engine
)
loan_df.head()

   loan_id  account_id    date  amount  duration  payments status status_desc
0     5314        1787  930705   96396        12    8033.0      B        None
1     5316        1801  930711  165960        36    4610.0      A        None
2     6863        9188  930728  127080        60    2118.0      A        None
3     5325        1843  930803  105804        36    2939.0      A        None
4     7240       11013  930906  274740        60    4579.0      A        None

#### 2. Save the table loan with only status A and B

In [11]:
data = pd.read_sql_query('SELECT * FROM bank.loan where status in ("A", "B") ', engine)
data.head()

   loan_id  account_id    date  amount  duration  payments status status_desc
0     5314        1787  930705   96396        12    8033.0      B        None
1     5316        1801  930711  165960        36    4610.0      A        None
2     6863        9188  930728  127080        60    2118.0      A        None
3     5325        1843  930803  105804        36    2939.0      A        None
4     7240       11013  930906  274740        60    4579.0      A        None

#### 3. Keep only the first 5 rows from trans table

In [12]:
query = "SELECT * FROM bank.trans LIMIT 5"
trans_df = pd.read_sql_query(query,engine)
trans_df.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,,,0
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,,,0
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,,,0
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,,,0
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,,,0

## JOINs in SQL:

**(INNER) JOIN**: Returns the values that are simultaneously in both tables    
**LEFT (OUTER) JOIN**: Returns all the values in the left table and the matching values in the right table
**RIGHT (OUTER) JOIN**: Returns all the values in the right table and the matching values in the left table
**FULL (OUTER) JOIN**: Returns all values in the left table or in the right table

![joins](sql-joins.jpg)

### ACTIVITY 2:  Datasets manipulation

In [13]:
engine.execute("USE bank")

#### Read trans and account tables and put them together

In [14]:
query_trans = "SELECT * FROM trans"
trans_df = pd.read_sql_query(query_trans, engine)
trans_df.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,,,0
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,,,0
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,,,0
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,,,0
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,,,0

In [15]:
query_account = "SELECT * FROM account"
account_df = pd.read_sql_query(query_account, engine)
account_df.head()

   account_id  district_id         frequency    date
0           1           18  POPLATEK MESICNE  950324
1           2            1  POPLATEK MESICNE  930226
2           3            5  POPLATEK MESICNE  970707
3           4           12  POPLATEK MESICNE  960221
4           5           15  POPLATEK MESICNE  970530

In [16]:
new_df = trans_df.merge(account_df, on="account_id", how="inner")
new_df.head()

,trans_id,account_id,date_x,type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,date_y
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,,,0,16,POPLATEK MESICNE,930101
1,695250,2378,930122,PRIJEM,VKLAD,7268.0,7968.0,,,0,16,POPLATEK MESICNE,930101
2,695266,2378,930123,PRIJEM,VKLAD,14440.0,22408.0,,,0,16,POPLATEK MESICNE,930101
3,695262,2378,930124,PRIJEM,VKLAD,49752.0,72160.0,,,0,16,POPLATEK MESICNE,930101
4,695265,2378,930126,PRIJEM,VKLAD,21899.0,94059.0,,,0,16,POPLATEK MESICNE,930101

In [17]:
new_df = new_df.rename(columns={"date_x":"date_trans","date_y":"date_account"})
new_df.columns

Index(['trans_id', 'account_id', 'date_trans', 'type', 'operation', 'amount',
       'balance', 'k_symbol', 'bank', 'account', 'district_id', 'frequency',
       'date_account'],
      dtype='object')

In [18]:
len(new_df)

868019

#### a) Keep the PRIJEM transactions in another dataset

In [19]:
new_df_1 = new_df[new_df.type == "PRIJEM"]
new_df_1.head()

,trans_id,account_id,date_trans,type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,date_account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,,,0,16,POPLATEK MESICNE,930101
1,695250,2378,930122,PRIJEM,VKLAD,7268.0,7968.0,,,0,16,POPLATEK MESICNE,930101
2,695266,2378,930123,PRIJEM,VKLAD,14440.0,22408.0,,,0,16,POPLATEK MESICNE,930101
3,695262,2378,930124,PRIJEM,VKLAD,49752.0,72160.0,,,0,16,POPLATEK MESICNE,930101
4,695265,2378,930126,PRIJEM,VKLAD,21899.0,94059.0,,,0,16,POPLATEK MESICNE,930101

#### b) Keep the VYBER transactions in another dataset

In [20]:
new_df_2 = new_df[new_df.type == "VYBER"]
new_df_2.head()

,trans_id,account_id,date_trans,type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,date_account
61,695411,2378,930926,VYBER,VYBER,8850.0,92888.8,,,0,16,POPLATEK MESICNE,930101
73,695412,2378,931113,VYBER,VYBER,12501.0,25367.6,,,0,16,POPLATEK MESICNE,930101
95,695424,2378,940309,VYBER,VYBER,17968.0,22370.5,,,0,16,POPLATEK MESICNE,930101
101,695421,2378,940409,VYBER,VYBER,2373.0,38971.1,,,0,16,POPLATEK MESICNE,930101
108,695416,2378,940531,VYBER,VYBER,19052.0,28090.8,,,0,16,POPLATEK MESICNE,930101

In [21]:
new_df_2.type.unique()

array(['VYBER'], dtype=object)

#### c) Check the lengths of both, concat them and check the length of the concatenation

In [22]:
len(new_df_1)

339950

In [23]:
len(new_df_2)

14092

In [24]:
concat_df = pd.concat([new_df_1,new_df_2])
concat_df.head()

,trans_id,account_id,date_trans,type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,date_account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,,,0,16,POPLATEK MESICNE,930101
1,695250,2378,930122,PRIJEM,VKLAD,7268.0,7968.0,,,0,16,POPLATEK MESICNE,930101
2,695266,2378,930123,PRIJEM,VKLAD,14440.0,22408.0,,,0,16,POPLATEK MESICNE,930101
3,695262,2378,930124,PRIJEM,VKLAD,49752.0,72160.0,,,0,16,POPLATEK MESICNE,930101
4,695265,2378,930126,PRIJEM,VKLAD,21899.0,94059.0,,,0,16,POPLATEK MESICNE,930101

In [25]:
print("concat_df length:",len(concat_df))
print("sum of new_df_1 and new_df_2 length:",len(new_df_1)+len(new_df_2))

concat_df length: 354042
sum of new_df_1 and new_df_2 length: 354042

#### d) Create a new column determining it the balance is higher thant the amount

In [26]:
concat_df['balance_amount'] = concat_df['amount']<concat_df['balance']
concat_df.head()

,trans_id,account_id,date_trans,type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,date_account,balance_amount
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,,,0,16,POPLATEK MESICNE,930101,False
1,695250,2378,930122,PRIJEM,VKLAD,7268.0,7968.0,,,0,16,POPLATEK MESICNE,930101,True
2,695266,2378,930123,PRIJEM,VKLAD,14440.0,22408.0,,,0,16,POPLATEK MESICNE,930101,True
3,695262,2378,930124,PRIJEM,VKLAD,49752.0,72160.0,,,0,16,POPLATEK MESICNE,930101,True
4,695265,2378,930126,PRIJEM,VKLAD,21899.0,94059.0,,,0,16,POPLATEK MESICNE,930101,True

#### e) Create the same column than before but as boolean

In [27]:
concat_df['checking'] = 0

In [28]:
concat_df['checking'][concat_df['amount']<concat_df['balance']] = 1

/var/folders/bh/c5_b88tj693bv1zhqfydl5j80000gn/T/ipykernel_37443/1037668155.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  concat_df['checking'][concat_df['amount']<concat_df['balance']] = 1

In [29]:
concat_df.head()

,trans_id,account_id,date_trans,type,operation,amount,balance,k_symbol,bank,account,district_id,frequency,date_account,balance_amount,checking
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,,,0,16,POPLATEK MESICNE,930101,False,0
1,695250,2378,930122,PRIJEM,VKLAD,7268.0,7968.0,,,0,16,POPLATEK MESICNE,930101,True,1
2,695266,2378,930123,PRIJEM,VKLAD,14440.0,22408.0,,,0,16,POPLATEK MESICNE,930101,True,1
3,695262,2378,930124,PRIJEM,VKLAD,49752.0,72160.0,,,0,16,POPLATEK MESICNE,930101,True,1
4,695265,2378,930126,PRIJEM,VKLAD,21899.0,94059.0,,,0,16,POPLATEK MESICNE,930101,True,1